/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_print_memory.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dano <dano@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/25 16:39:18 by dano              #+#    #+#             */
/*   Updated: 2022/10/25 16:42:18 by dano             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

// 출력 함수
void ft_putchar(char c)
{
    write(1, &c, 1);
}

// 메인 함수
void *ft_print_memory(void *addr, unsigned int size)
{

}
