#include <stdio.h>
int main(void) {

  int arr0[5];
  // □ □ □ □ □

  int arr1[2][5]; // => 5개의 공간을 가진 2개 공간의 배열
  // □ □ □ □ □
  // □ □ □ □ □

  int arr2[3][2];
  // □ □
  // □ □
  // □ □

  int arr3[3][3][3];
  // □ □ □
  // □ □ □
  // □ □ □

  // □ □ □
  // □ □ □
  // □ □ □

  // □ □ □
  // □ □ □
  // □ □ □

  int arr4[5] = { 0, 1, 2, 3, 4 };
  int arr5[2][5] = { 
    { 1, 2, 3, 4, 5 }, 
    { 1, 2, 3, 4, 5 } 
  };
  int arr6[3][3][3] = { 
    { 
      { 1, 2, 3 }, 
      { 4, 5, 6 }, 
      { 7, 8, 9 } 
    }, 
    { 
      { 11, 12, 13 }, 
      { 14, 15, 16 }, 
      { 17, 18, 19 } 
    }, 
    { 
      { 21, 22, 23 }, 
      { 24, 25, 26 }, 
      { 27, 28, 29 } 
    } 
  };
  int arr7[4][2] = {
    { 1, 2 },
    { 3, 4 },
    { 5, 6 },
    { 7, 8 }
  };

  for (int i = 0; i < 4; i++) {
    for (int j = 0; j < 2; j++) {
      printf("2차원배열 (%d, %d)의 값 : %d\n", i, j, arr7[i][j]);
    }
    printf("\n");
  }

    for (int i = 0; i < 3; i++) {
      for (int j = 0; j < 3; j++) {
        for (int k = 0; k < 3; k++) {
          printf("3차원 배열 (%d, %d, %d)의 값 : %d\n", i ,j, k, arr6[i][j][k]);
        }
        printf("\n");
      }
    printf("\n");
  }

  return 0;
}